#### `terraform plan` Success
<details><summary>Show Output</summary>

```
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/foreign-language-reader/infrastructure/runs/run-wue4JBbEFP45Ppdd

Waiting for the plan to start...

Terraform v0.14.3
Configuring remote state backend...
Initializing Terraform configuration...
module.infrastructure.module.content.aws_iam_user.spark: Refreshing state... [id=spark]
module.infrastructure.module.elasticsearch.aws_s3_bucket.backup: Refreshing state... [id=foreign-language-reader-elasticsearch-backups]
module.infrastructure.module.content.aws_s3_bucket.content: Refreshing state... [id=foreign-language-reader-content]
module.infrastructure.module.content.aws_iam_user.github: Refreshing state... [id=github-spark-deploy]
module.infrastructure.aws_iam_user.github: Refreshing state... [id=foreign-language-reader-github]
module.infrastructure.module.elasticsearch.aws_iam_user.elasticsearch: Refreshing state... [id=elasticsearch]
module.infrastructure.tls_private_key.tls_private_key: Refreshing state... [id=96c5128d225c1725a7d5fda91c9f195dd1837181]
module.infrastructure.module.api.random_password.truststore_password: Refreshing state... [id=none]
module.infrastructure.module.content.random_password.elasticsearch_password: Refreshing state... [id=none]
module.infrastructure.module.monitoring.random_password.fluent_elasticsearch_password: Refreshing state... [id=none]
module.infrastructure.module.content.random_password.truststore_password: Refreshing state... [id=none]
module.infrastructure.module.api.random_password.application_secret: Refreshing state... [id=none]
module.infrastructure.module.api.random_password.elasticsearch_password: Refreshing state... [id=none]
module.infrastructure.acme_registration.reg: Refreshing state... [id=https://acme-v02.api.letsencrypt.org/acme/acct/106949055]
module.infrastructure.module.database.digitalocean_database_cluster.api_mysql: Refreshing state... [id=97a6496b-04f1-4782-b98e-9eec8b5fcf78]
digitalocean_kubernetes_cluster.foreign_language_reader: Refreshing state... [id=2132b4c2-fd9e-496c-8419-a39da7d142f0]
module.infrastructure.digitalocean_domain.main: Refreshing state... [id=foreignlanguagereader.com]
module.infrastructure.module.content.aws_iam_access_key.spark: Refreshing state... [id=AKIAQRKEJGTPARQC5JMK]
module.infrastructure.module.elasticsearch.aws_iam_access_key.elasticsearch: Refreshing state... [id=AKIAQRKEJGTPK4BHXIN6]
module.infrastructure.aws_iam_access_key.github: Refreshing state... [id=AKIAQRKEJGTPHZFIVEWW]
module.infrastructure.module.content.aws_iam_access_key.github: Refreshing state... [id=AKIAQRKEJGTPFPDKDIM2]
module.infrastructure.module.frontend.aws_s3_bucket.main: Refreshing state... [id=www.foreignlanguagereader.com]
module.infrastructure.module.storybook.aws_s3_bucket.main: Refreshing state... [id=storybook.foreignlanguagereader.com]
module.infrastructure.module.database.digitalocean_database_firewall.allow_kubernetes: Refreshing state... [id=97a6496b-04f1-4782-b98e-9eec8b5fcf78-20210110101244536900000001]
module.infrastructure.module.monitoring.helm_release.prometheus_operator: Refreshing state... [id=prometheus]
module.infrastructure.module.monitoring.helm_release.fluentd_elasticsearch: Refreshing state... [id=fluentd]
module.infrastructure.module.content.helm_release.spark: Refreshing state... [id=spark]
module.infrastructure.module.elasticsearch.helm_release.elasticsearch: Refreshing state... [id=elastic-operator]
module.infrastructure.module.nginx_ingress.helm_release.nginx_ingress: Refreshing state... [id=nginx-ingress]
module.infrastructure.module.content.kubernetes_secret.spark_config: Refreshing state... [id=default/spark-config]
module.infrastructure.module.elasticsearch.kubernetes_secret.elasticsearch_roles: Refreshing state... [id=default/elasticsearch-roles]
module.infrastructure.module.api.kubernetes_service.api: Refreshing state... [id=default/api]
module.infrastructure.module.api.kubernetes_horizontal_pod_autoscaler.api_autoscale: Refreshing state... [id=default/api]
module.infrastructure.module.api.kubernetes_secret.application-secret: Refreshing state... [id=default/application-secret]
module.infrastructure.module.api.kubernetes_secret.elasticsearch_credentials: Refreshing state... [id=default/elasticsearch-credentials]
module.infrastructure.module.nginx_ingress.kubernetes_ingress.ingress: Refreshing state... [id=default/foreign-language-reader-ingress]
module.infrastructure.module.elasticsearch.kubernetes_secret.elasticsearch_aws_credentials: Refreshing state... [id=default/elasticsearch-s3-creds]
module.infrastructure.module.elasticsearch.digitalocean_record.elastic_subdomain_dns: Refreshing state... [id=128308864]
module.infrastructure.module.storybook.aws_cloudfront_distribution.s3_distribution: Refreshing state... [id=E1RVJJFB4SD5MG]
module.infrastructure.module.storybook.aws_s3_bucket_policy.public_access: Refreshing state... [id=storybook.foreignlanguagereader.com]
module.infrastructure.module.frontend.aws_cloudfront_distribution.s3_distribution: Refreshing state... [id=E33TYMXRYMHHGW]
module.infrastructure.module.api.kubernetes_deployment.api: Refreshing state... [id=default/api]
module.infrastructure.acme_certificate.certificate: Refreshing state... [id=https://acme-v02.api.letsencrypt.org/acme/cert/048581440bbcef4defc3dc4efa4224416862]
module.infrastructure.module.frontend.aws_s3_bucket_policy.public_access: Refreshing state... [id=www.foreignlanguagereader.com]
module.infrastructure.module.elasticsearch.digitalocean_record.kibana_subdomain_dns: Refreshing state... [id=128308865]
module.infrastructure.module.elasticsearch.aws_iam_policy.elasticsearch_backup: Refreshing state... [id=arn:aws:iam::037187302622:policy/elasticsearch-backup-role]
module.infrastructure.module.frontend.digitalocean_record.subdomain: Refreshing state... [id=127348003]
module.infrastructure.module.storybook.digitalocean_record.subdomain: Refreshing state... [id=127348002]
module.infrastructure.module.content.aws_iam_policy.deploy: Refreshing state... [id=arn:aws:iam::037187302622:policy/spark-deploy-role]
module.infrastructure.module.content.aws_iam_policy.spark_read: Refreshing state... [id=arn:aws:iam::037187302622:policy/spark-read-role]
module.infrastructure.module.nginx_ingress.kubernetes_secret.nginx_certificate: Refreshing state... [id=default/nginx-certificate]
module.infrastructure.module.elasticsearch.aws_iam_policy_attachment.elasticsearch_backup: Refreshing state... [id=elasticsearch-backup-role-attach]
module.infrastructure.module.frontend.aws_iam_policy.deploy: Refreshing state... [id=arn:aws:iam::037187302622:policy/www.foreignlanguagereader.com-deploy-role]
module.infrastructure.module.storybook.aws_iam_policy.deploy: Refreshing state... [id=arn:aws:iam::037187302622:policy/storybook.foreignlanguagereader.com-deploy-role]
module.infrastructure.module.content.aws_iam_policy_attachment.deploy: Refreshing state... [id=spark-deploy-role-attach]
module.infrastructure.module.content.aws_iam_policy_attachment.spark_read: Refreshing state... [id=spark-read-role-attach]
module.infrastructure.module.frontend.aws_iam_policy_attachment.deploy: Refreshing state... [id=www.foreignlanguagereader.com-deploy-role-attach]
module.infrastructure.module.elasticsearch.elasticsearch_snapshot_repository.backups: Refreshing state... [id=S3-backup]
module.infrastructure.module.elasticsearch.elasticsearch_user.fluentd: Refreshing state... [id=fluentd]
module.infrastructure.module.elasticsearch.elasticsearch_user.spark: Refreshing state... [id=spark]
module.infrastructure.module.elasticsearch.elasticsearch_user.api: Refreshing state... [id=apiprod]
module.infrastructure.module.storybook.aws_iam_policy_attachment.deploy: Refreshing state... [id=storybook.foreignlanguagereader.com-deploy-role-attach]
module.infrastructure.module.elasticsearch.elasticsearch_snapshot_lifecycle_policy.daily_backup: Refreshing state... [id=daily-snapshots]
module.infrastructure.module.elasticsearch.elasticsearch_index_lifecycle_policy.rollover: Refreshing state... [id=logging-rollover]
module.infrastructure.module.elasticsearch.elasticsearch_index_template.fluentd: Refreshing state... [id=fluentd]
module.infrastructure.module.nginx_ingress.digitalocean_record.kubernetes_subdomain_dns["api"]: Refreshing state... [id=128302476]

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.infrastructure.module.database.digitalocean_database_cluster.api_db will be created
  + resource "digitalocean_database_cluster" "api_db" {
      + database             = (known after apply)
      + engine               = "pg"
      + host                 = (known after apply)
      + id                   = (known after apply)
      + name                 = "foreign-language-reader"
      + node_count           = 1
      + password             = (sensitive value)
      + port                 = (known after apply)
      + private_host         = (known after apply)
      + private_network_uuid = (known after apply)
      + private_uri          = (sensitive value)
      + region               = "sfo2"
      + size                 = "db-s-1vcpu-1gb"
      + uri                  = (sensitive value)
      + urn                  = (known after apply)
      + user                 = (known after apply)
      + version              = "12"
    }

  # module.infrastructure.module.database.digitalocean_database_cluster.api_mysql will be destroyed
  - resource "digitalocean_database_cluster" "api_mysql" {
      - database             = "defaultdb" -> null
      - engine               = "mysql" -> null
      - host                 = "foreign-language-reader-do-user-1516704-0.b.db.ondigitalocean.com" -> null
      - id                   = "97a6496b-04f1-4782-b98e-9eec8b5fcf78" -> null
      - name                 = "foreign-language-reader" -> null
      - node_count           = 1 -> null
      - password             = (sensitive value)
      - port                 = 25060 -> null
      - private_host         = "private-foreign-language-reader-do-user-1516704-0.b.db.ondigitalocean.com" -> null
      - private_network_uuid = "0e5dfde0-e264-494b-8eab-1c004ca711bd" -> null
      - private_uri          = (sensitive value)
      - region               = "sfo2" -> null
      - size                 = "db-s-1vcpu-1gb" -> null
      - tags                 = [] -> null
      - uri                  = (sensitive value)
      - urn                  = "do:dbaas:97a6496b-04f1-4782-b98e-9eec8b5fcf78" -> null
      - user                 = "doadmin" -> null
      - version              = "8" -> null
    }

  # module.infrastructure.module.database.digitalocean_database_firewall.allow_kubernetes must be replaced
-/+ resource "digitalocean_database_firewall" "allow_kubernetes" {
      ~ cluster_id = "97a6496b-04f1-4782-b98e-9eec8b5fcf78" -> (known after apply) # forces replacement
      ~ id         = "97a6496b-04f1-4782-b98e-9eec8b5fcf78-20210110101244536900000001" -> (known after apply)

      - rule {
          - created_at = "2021-01-10T10:12:44Z" -> null
          - type       = "k8s" -> null
          - uuid       = "310091e2-2e69-460d-81aa-1caf8d6b3596" -> null
          - value      = "2132b4c2-fd9e-496c-8419-a39da7d142f0" -> null
        }
      + rule {
          + created_at = (known after apply)
          + type       = "k8s"
          + uuid       = (known after apply)
          + value      = "2132b4c2-fd9e-496c-8419-a39da7d142f0"
        }
    }

  # module.infrastructure.module.elasticsearch.elasticsearch_index_template.fluentd will be updated in-place
  ~ resource "elasticsearch_index_template" "fluentd" {
        id       = "fluentd"
        name     = "fluentd"
      ~ template = jsonencode(
          ~ {
              - fluentd        = {
                  - aliases        = {}
                  - index_patterns = [
                      - "logstash-*",
                    ]
                  - mappings       = {}
                  - order          = 0
                  - settings       = {
                      - index = {
                          - lifecycle = {
                              - name           = "logging-rollover"
                              - rollover_alias = "logstash-backup-alias"
                            }
                        }
                    }
                } -> null
              + index_patterns = [
                  + "logstash-*",
                ]
              + settings       = {
                  + index.lifecycle.name           = "logging-rollover"
                  + index.lifecycle.rollover_alias = "logstash-backup-alias"
                }
            }
        )
    }

Plan: 2 to add, 1 to change, 2 to destroy.

Warning: Release does not exist

Release name: spark does not exist. It may have been deleted outside of
Terraform

```

</details>

*Workflow: `Test infrastructure plan`, Action: `hashicorpterraform-github-actions4`, Working Directory: `.`, Workspace: `default`*
